Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceNdfType
The property labeled "NDF" from the "PrismLayered" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SurfaceNdfType".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceRoughness
The property labeled "Roughness" from the "PrismLayered" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceRotation
The property labeled "Rotation" from the "PrismLayered" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceCutout
The property labeled "Image" from the "PrismLayered" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceNormal
The property labeled "Image" from the "PrismLayered" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceAnisotropy
The property labeled "Anisotropy" from the "PrismLayered" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceAlbedo
The property labeled "Color" from the "PrismLayered" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedLayered.LayeredNdfType
The property labeled "NDF" from the "PrismLayered" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "LayeredNdfType".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedLayered.LayeredRoughness
The property labeled "Roughness" from the "PrismLayered" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedLayered.LayeredRotation
The property labeled "Rotation" from the "PrismLayered" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedLayered.LayeredNormal
The property labeled "Image" from the "PrismLayered" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedLayered.LayeredAnisotropy
The property labeled "Anisotropy" from the "PrismLayered" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedLayered.LayeredDiffuse
The property labeled "Color" from the "PrismLayered" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedLayered.LayeredFraction
The property labeled "Fraction" from the "PrismLayered" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedLayered.LayeredF0
The property labeled "Clearcoat reflectance" from the "PrismLayered" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedLayered.LayeredBottomF0
The property labeled "Color" from the "PrismLayered" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedLayered
Represents the properties of materials.
Since:
2018.1